Revit 2027 API
ReferenceIntersector.GetTargetElementIds Method
 Gets the set of ElementIds to test from in intersection testing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetTargetElementIds()
Public Function GetTargetElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetTargetElementIds()
member GetTargetElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The target ElementIds.
See Also
Reference
ReferenceIntersector Class
Autodesk.Revit.DB Namespace